// Теперь внесите такие изменения в программу из упражнения 5, чтобы она мог­ла 
// вычислять сумму квадратов целых чисел. (Или, если вам так больше нравит­ся, 
// программа вычисляет, какую сумму денег вы получите, если в первый день
// вам заnпатят $1, во второй день $4, в третий день $9 и так далее. Такая 
// ин­терпретация намного симпатичнее!) В языке С нет функции возведения в квад­рат, 
// но в этом случае вам поможет oсознание того, что квадратом числа n являет­ся 
// n * n .
#include <stdio.h>

int main(void) {
    int i = 0;
    int res = 0;
    printf("Enter number of iterations: ");
    scanf("%d", &i);
    for(int a = 1; a <= i; a++) {
        res = a * a;
        printf("%d\n", res);
    }
    printf("\n\n");
}