// Напишите программу, которая запрашивает ввод целого числа, а затем печата­ет 
// все целые числа, начиная (и включая) с этого числа и до числа, большего
// введенной величины на 10 включительно. (Иначе говоря, если вводится число
// 5, то выходными данными являются числа от 5 до 15 включительно) Обяза­тельно 
// отделите друг от друга значения выходных данных пробелом либо 
// сим­волами табуляции или новой строки.
#include <stdio.h>

int main(void) {
    int input = 0;
    printf("Type your number: ");
    scanf("%d", &input);
    printf("Your numbers are: ");
    for(int i = 0; i <= 10; i++) {
        printf("%d ", input++);
    }
    printf("\n\n");
}