// Внесите изменения в программу addemup.c (листинг 5.13), которая вычисляет
// сумму 20 первых целых чисел. (При желании вы можете рассматривать
// addemup.с как программу, которая вычисляет, какую сумму денег вы получите за
// 20 дней, если в первый день вы получаете $1, во второй день - $2, в третий
// день - $3 и так далее.) Внесите в эту программу изменения, благодаря которым
// вы можете в интерактивном режиме указать, насколько далеко зайдут вычисле­ния. 
// Другими словами, замените целое число 20 переменной, значение которой
// программа может вводить.
#include <stdio.h>

int main(void) {
    int i = 0;
    int res = 0;
    printf("Enter number of iterations: ");
    scanf("%d", &i);
    for(int a = 1; a <= i; a++) {
        res += a;
    }
    printf("%d", res);
    printf("\n\n");
}